// 1. Сумма двух чисел
// Напишите функцию, которая принимает два числа и возвращает их сумму.

// 2. Проверка на четность
// Напишите функцию, которая проверяет, является ли число четным.

// 3. Нахождение максимального числа
// Напишите функцию, которая принимает три числа и возвращает наибольшее из них.

// 4. Преобразуйте строку в число
// Напишите функцию, которая может преобразовать строку в число. "1234" --> 1234

// 5. Преобразовать логические значения в строки «Да» или «Нет»
// Завершите метод, который принимает логическое значение и возвращает "Yes"строку для true или "No" строку для false.

// 6. Противоположное число.
// напишите стрелочную функцию в одну строку которая возвращает противоположное число

// 7. Вывод чисел от 1 до N
// Напишите цикл, который выводит числа от 1 до N.

// function printNumbers(n) {
//     for (let i = 1; i <= n; i++) {
//         console.log(i);
//     }
// }
// printNumbers(5); // Ожидаемый результат: 1, 2, 3, 4, 5


// 8. Сумма чисел от 1 до N
// Напишите цикл, который вычисляет сумму чисел от 1 до N.

9. 

// function multiplicationTable(n) {
//     for (let i = 1; i <= 10; i++) {
//         console.log(`${n} * ${i} = ${n * i}`);
//     }
// }

// multiplicationTable(5); // Ожидаемый результат: 5 * 1 = 5, 5 * 2 = 10, ..., 5 * 10 = 50